using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp2
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Название «байт» (слово byte представляет собой сокращение словосочетания BinarYTErm — «двоичный терм») было впервые использовано в 1956 году В. Бухгольцем при проектировании первого суперкомпьютера IBM 7030 Stretch.\r\nВ 1950-х и 1960-х годах не было единого стандарта относительно количества битов в байте. В разных компьютерных системах байт содержал от 6 до 9 битов.\r\nЛишь с начала 1970-х годов в большинстве архитектур стали использовать байт размером 8 битов, и постепенно такое соотношение стало стандартным.\r\nДля устранения двусмысленности в компьютерной литературе иногда для точного обозначения последовательности 8 битов вместо термина «байт» используют термин «октет».\r\n");
            Console.ReadKey();
        }
    }
}
